# As a customer analyst, I want to know who has spent the most money with us over their lifetime. 
- I have monthly charges and tenure, so I think I will be able to use those two attributes as features to estimate total_charges. 
- I need to do this within an average of $5.00 per customer.

- Acquire customer_id, monthly_charges, tenure, and total_charges from telco_churn database for all customers with a 2 year contract.

- Walk through the steps above using your new dataframe. You may handle the missing values however you feel is appropriate.

- End with a python file wrangle.py that contains the function, `wrangle_telco()`, that will acquire the data and return a dataframe cleaned with no missing values.

In [20]:
import numpy as np
import pandas as pd
from env import get_url

In [21]:
# Set the connection url for the telco_churn db
url = get_url("telco_churn")

sql = """
    select customer_id, monthly_charges, tenure, total_charges
    from customers
    join contract_types using(contract_type_id)
    where contract_type = "Two year";
"""
df = pd.read_sql(sql, url)

In [22]:
df.head()

  customer_id  monthly_charges  tenure total_charges
0  0013-SMEOE           109.70      71       7904.25
1  0014-BMAQU            84.65      63        5377.8
2  0016-QLJIS            90.45      65        5957.9
3  0017-DINOC            45.20      54       2460.55
4  0017-IUDMW           116.80      72       8456.75

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1695 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [24]:
## Looks like wev
df.total_charges.value_counts()

           10
5682.25     2
844.45      2
343.45      2
3533.6      2
           ..
6096.45     1
808.95      1
7108.2      1
5459.2      1
945.7       1
Name: total_charges, Length: 1678, dtype: int64

In [25]:
df.total_charges = df.total_charges.str.strip()

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1695 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [32]:
df = df[df.total_charges != ""]
df.total_charges = df.total_charges.astype(float)

In [33]:
df.describe()

       monthly_charges      tenure  total_charges
count      1685.000000  1685.00000    1685.000000
mean         60.872374    57.07181    3728.933947
std          34.712210    17.72913    2571.252806
min          18.400000     1.00000      20.350000
25%          24.050000    48.00000    1278.800000
50%          64.450000    64.00000    3623.950000
75%          90.550000    71.00000    5999.850000
max         118.750000    72.00000    8672.450000

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1685 non-null   object
 1   monthly_charges  1685 non-null   float64
 2   tenure           1685 non-null   int64
 3   total_charges    1685 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 65.8+ KB